import streamlit as st

st.title("Міні-опитування 😊")

st.write("Відповідай на кілька питань:")

# Питання 1
color = st.radio(
    "1️⃣ Який твій улюблений колір?",
    ["Синій", "Зелений", "Червоний"]
)

# Питання 2
pets = st.radio(
    "2️⃣ Чи любиш ти домашніх тварин?",
    ["Так", "Ні"]
)

# Кнопка результату
if st.button("Показати результат"):
    st.subheader("Результат опитування")

    st.write(f"🎨 Улюблений колір: **{color}**")
    st.write(f"🐾 Любов до тварин: **{pets}**")

    if pets == "Так":
        st.success("Ти добра людина 💚")
    else:
        st.info("Можливо, ти просто більше любиш тишу 😌")
